# FamilyElementVisibility Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyElementVisibility Constructor
FamilyElementVisibility Class See Also
---
Initializes a new instance of the FamilyElementVisibility class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyElementVisibility(
	FamilyElementVisibilityType visibilityType
)
```

Visual Basic
---
```text
Public Sub New ( _
	visibilityType As FamilyElementVisibilityType _
)
```

Visual C++
---
```text
public:
FamilyElementVisibility(
	FamilyElementVisibilityType visibilityType
)
```

# ### Parameters
visibilityType
    Type: Autodesk.Revit.DB..::..FamilyElementVisibilityType
# See Also
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace